{
  "slug": "zu_wsa",
  "title": "BLE Audio Testing Framework",
  "description": "The world's third largest manufacturer of hearing aids, tests its devices with technology, that we developed according to cutting edge standards.",
  "about": "WS Audiology is a multi-national company, that develops, manufactures and distributes hearing aids under a range of brands. With roughly 12000 employees and locations in Germany, Denmark and Singapore, WSA is a true heavy weight in the hearing aid sector.",
  "challenge": "Our client wanted to perform automatic integration tests for the brand new BLE Audio Standard on their devices. The project received a lot of attention from the management right from the start, and proved itself time and time again.",
  "deliveredValue": "We wanted to quickly reach a high test coverage, while at the same time providing an excellent product that will be useful long-term. To achieve this we implemented a modular and malleable software architecture, that allowed us to develop the entire system iteratively. When th requirements changed fundamentally about half way of the project, we were in an excellent position to react.",
  "product": "In-depth requirements and feasibility analysis in a complex multi-stakeholder environment — Development of a testing framework for Bluetooth LE Audio testing from scratch for central driven, automated testing of novel hearing aid firmware — Communication between the test central and the test PC via Protocol Buffers (NanoPB) — Zephyr based firmware architecture design and implementation in modern C++ — Development of firmware modules for audio processing under hard real-time constraints — Test framework architecture design and implementation in Python/Pytest — Hybrid approach using the Zephyr shell as well custom firmware implementation, for very high code coverage in very limited time — Implementation of hundreds of tests that caught dozens of issues — Refactoring, bug fixing and extension of neighboring legacy systems — CI/CD integration — Internal training of company employees on the use and extension of the test system",
  "tech": ["Embedded C++20", "Nordic Semiconductor", "ARM Cortex-M", "Zephyr", "BLE Audio", "Pytest", "Protobuf", "CMake", "FreeRTOS", "Multithreading", "Multicore", "Hard real time"],
  "testimonials": [96, 97],
  "image": "../assets/wsa.jpg"
}
