{
  "slug": "a_development",
  "title": "Softwareentwicklung",
  "description": "Wir entwickeln Softwarelösungen, die genau auf Ihren Anwendungsfall zugeschnitten sind. Eingebettete Systeme sind unsere Spezialität, insbesondere auch Mikrocontroller. Hier erfahren Sie mehr über unseren Tech-Stack.",
  "tech": [ 
    {
      "name": "C++",
      "description": "C++ ist einzigartig gut geeigenet, die Brücke zu schlagen zwischen den Anforderungen von eingebetteten Geräten und den Anforderungen moderner Softwareentwicklung. Wir setzen den modernsten Standard ein, den Ihr Anwendungsfall zulässt.",
      "image": "../assets/tech/cpp.svg"
    },
    {
      "name": "CMake",
      "description": "Buildtoolchains im Embeddedbereich sind immer noch häufig geprägt von herstellerspezifischen Lösungen geprägt. Um Ihre Entwicklungsabläufe miteinander verknüpfen zu können, verwenden wir CMake, den Goldstandard für C/C++ Projekte.",
      "image": "../assets/tech/cmake.svg"
    },
    {
      "name": "Python",
      "description": "Die reiche Landschaft an Bibliotheken und die Plattformunabhängigkeit machen Python zum Mittel unserer Wahl für Tooling und Scripting auf dem Host.",
      "image": "../assets/tech/python.png"
    },
    {
      "name": "Arm Cortex",
      "description": "Die Cortex-M Familie von ARM ist stark vertreten am Embeddedmarkt und uns narürlich bestens bekannt.",
      "image": "../assets/tech/arm.png"
    },
    {
      "name": "ST Microelectronics",
      "description": "Wir sind große Fans der STM32 Familie, und greifen Ihnen gern unter die Arme bei der Entwicklung für diese MCUs.",
      "image": "../assets/tech/stm.png"
    },
    {
      "name": "Nordic Semiconductor",
      "description": "Das IoT Powerhouse am Mikrocontrollermarkt. Wir unterstützen Sie gerne bei der Entwicklung in diesem Ökosystem, egal ob nRF Connect SDK oder Vanilla Zephyr.",
      "image": "../assets/tech/nordic.svg"
    },
    {
      "name": "Risc-V",
      "description": "Risc-V Architekturen sind immer häufiger anzutreffen. Wir haben bereits konkrete Projekterfahrung sammeln können.",
      "image": "../assets/tech/risc_v.jpeg"
    },
    {
      "name": "Espressif",
      "description": "Espressif ist längst aus der Makerszene heraus gewachsen und wir haben schon einige große Unternehmen bei der Integration von ihren Produkten unterstützt. Vielleicht Sie auch?",
      "image": "../assets/tech/espressif.svg"
    },
    {
      "name": "Bluetoth",
      "description": "Wir entwickeln Ihre Bluetooth Schnittstelle, sei es Classic, Low Energy oder LE Audio, wir kennen alle Standards.",
      "image": "../assets/tech/bluetooth.png"
    },
    {
      "name": "FreeRTOS",
      "description": "Auch bei uns das am meisten verbreitete RTOS. Leichtgewichtig und sehr anpassbar passt es sehr gut zu unserer Philosophie.",
      "image": "../assets/tech/freertos.svg"
    },
    {
      "name": "Zephyr",
      "description": "Mit dem vermutlich vollständigsten BLE Stack am Markt führt an Zephyr manchmal kein Weg vorbei. Wir unterstützen Sie hier!",
      "image": "../assets/tech/zephyr.svg"
    }
  ],
  "image": "../assets/development.png",
  "tags": ["cpp", "development"]
}
