{
  "slug": "s01_development",
  "title": "Software Development",
  "description": "We develop software solutions that are tailored to your use case. Our specialty are embedded systems, specifically including microcontrollers. Here you can learn a little about our tech stack.",
  "tech": [ 
    {
      "name": "C++",
      "description": "C++ is uniquely suited to bridge the gap between the constraints of a embedded device and the requirements of modern software development. We use the most recent standard that your use case allows. ",
      "image": "../assets/tech/cpp.svg"
    },
    {
      "name": "CMake",
      "description": "Often, build toolchains in the embedded sector are still dominated by vendor specific solutions. To be able to integrate your development process with one another, we use CMake, the gold standard for C/C++ projects.",
      "image": "../assets/tech/cmake.svg"
    },
    {
      "name": "Python",
      "description": "The rich library landscape and the fact that it's platform agnostic make Python our number one choice for tooling and scripting on the host.",
      "image": "../assets/tech/python.png"
    },
    {
      "name": "Arm Cortex",
      "description": "The Cortex-M family is very wide spread on the embedded market and intimately known to us.",
      "image": "../assets/tech/arm.png"
    },
    {
      "name": "ST Microelectronics",
      "description": "We are big fans of the STM32 family, and are are happy to support you in the development for these MCUs",
      "image": "../assets/tech/stm.png"
    },
    {
      "name": "Nordic Semiconductor",
      "description": "The IoT powerhouse on the microcontroller scene. We can assist you in the development in this eco-system, be it based on the nRF Connect SDK or vanilla Zephyr.",
      "image": "../assets/tech/nordic.svg"
    },
    {
      "name": "Risc-V",
      "description": "Risc-V architecture are gaining popularity. We have hands-on project experience already.",
      "image": "../assets/tech/risc_v.jpeg"
    },
    {
      "name": "Espressif",
      "description": "Espressif has long grown out of its maker-scence origins, and we have supported with a couple of large companies with integrating their devices. Maybe you too?",
      "image": "../assets/tech/espressif.svg"
    },
    {
      "name": "Bluetooth",
      "description": "We develop your Bluetooth interface. Be it Classic, Low Energy or LE Audio, we know all the standards.",
      "image": "../assets/tech/bluetooth.png"
    },
    {
      "name": "FreeRTOS",
      "description": "The most popular RTOS, also fo us. Light weight and very customizable, just as we like it.",
      "image": "../assets/tech/freertos.svg"
    },
    {
      "name": "Zephyr",
      "description": "They have the most complete BLE stack on the market, so sometimes there is no alternative. We support you here!",
      "image": "../assets/tech/zephyr.svg"
    }
  ],
  "image": "../assets/development.png",
  "tags": ["cpp", "development"]
}
