{
  "slug": "c02_cropled_plc",
  "title": "Powerline Kommunikationsschnittstelle",
  "description": "Wir haben es unserm Kunden ermöglicht seine Produkte über die Stromversorgung zu vernetzen.",
  "about": "Die cropled AG ist ein Schweizer Startup, das es sich zum Ziel gesetzt hat Indoor-Farming zu revolutionieren. Ihr Hauptprodukt ist \"aurora\", eine mit IoT-Standards untereinander vernetzte und cloud-integrierte LED Pflanzenbeleuchtung. Mit ihrer Idee haben sie verschiedene Preise gewonnen, wie zum Beispiel den Zünder Award und Venture Kick.",
  "challenge": "Unter großem Zeitdruck suchte der Kunde nach einer Lösung eine große Anzahl Lampen miteinander zu vernetzen, ohne die ganze Kommunikation drahtlos zu gestalten. Nachdem bereits bereits einige Versuche fehlgeschlagen waren, fragte die cropled AG uns an, für die Entwicklung einer Kommunikationslösung, die die Lampen über ihre Stromversorgungsleitungen miteinander vernetzt.",
  "deliveredValue": "Danke einer fokussierte Startphase und Anforderungsplanung konnten wir dem Kunden termingerecht, genau das liefern was er gesucht hatte. Die von uns entwickelte Kommunikationsschnittstelle entlastet die bereits implementierten, drahtlosen Kommunikationsstandards, so dass die cropled AG hier nun eine wirklich skalierfähige Technologie im Portfolio hat, die sie von der Konkurrenz abhebt.",
  "product": "Anforderungsanalyse, Konzeption, Design, Implementierung und Test einer Powerline-Kommunikationsschnittstelle (PLC), die die Kommunikation zwischen ESP32-Mikrocontrollern über die bestehende Stromversorgungsleitungen ermöglicht — FreeRTOS und C++20 basiert — Fehlersuche in der Hardware und Durchführung von Anpassungen im Feld — Treiberentwicklung für den PLC Transceiver — Nach Kundenwünschen maßgeschneiderter Algorithmus zur verteilten Konsensfindung auf Raft-Basis — Kommunikationsschnittstelle für die adressierte Full-Duplex-Kommunikation auf UART-Basis inkl. Definition einer geeigneten Datenpaketstruktur — Firmwareduplizierung über PLC, um OTA-artige Firmwareupdates zu ermöglichen",
  "tech": ["Embedded C++20", "ESP32", "FreeRTOS", "Consensus Algorithms", "Device Firmware Upgrades", "UART", "lwip", "TCP/IP", "Sockets", "Multithreading", "Multicore"],
  "testimonials": [2, 1],
  "image": "../assets/cropled_plc.jpg"
}
